## Pandas Nedir?

- Python i√ßin veri analizi k√ºt√ºphanesidir.

- Adƒ± ‚ÄúPanel Data‚Äù kavramƒ±ndan gelir.

- Tablo (Excel gibi) veya seri (tek s√ºtun) verilerle √ßalƒ±≈ümayƒ± kolayla≈ütƒ±rƒ±r.

- NumPy √ºzerine kuruludur ‚Üí yani hƒ±z a√ßƒ±sƒ±ndan yine NumPy‚Äônin g√ºc√ºn√º kullanƒ±r ama daha kolay bir aray√ºz sunar.

### Ne ƒ∞≈üe Yarar?

#### Veri okuma/yazma:

- CSV, Excel, SQL, JSON gibi farklƒ± formatlardan veri alƒ±p yazabilirsin.

- √ñrn: pd.read_csv("dosya.csv")

#### Tablo yapƒ±sƒ± (DataFrame):

- Satƒ±r‚Äìs√ºtun yapƒ±sƒ±nda verilerle √ßalƒ±≈üabilirsin.

- Excel gibi d√º≈ü√ºnebilirsin.

#### Veri temizleme:

- Eksik deƒüerleri doldurabilir/silebilirsin.

- Tekrarlayan kayƒ±tlarƒ± kaldƒ±rabilirsin.

#### Veri se√ßme/filtreleme:

- ƒ∞stediƒüin satƒ±r/s√ºtunlarƒ± kolayca se√ßebilirsin.

#### ƒ∞statistiksel i≈ülemler:

- Ortalama, toplam, gruplama, sƒ±ralama gibi i≈ülemler kolay yapƒ±lƒ±r.

#### Veri d√∂n√º≈üt√ºrme:

- Verileri birle≈ütirebilir, yeniden ≈üekillendirebilir, indeksleme yapabilirsin.

#### 1. Series

- Tek boyutlu (liste gibi) veri yapƒ±sƒ±dƒ±r.

- Hem veri hem de etiket (index) i√ßerir.

- NumPy array‚Äôe benzer ama yanƒ±nda etiket bilgisi vardƒ±r.

#### 2. DataFrame

- ƒ∞ki boyutlu tablo yapƒ±sƒ±dƒ±r (Excel sayfasƒ± gibi).

- Satƒ±rlar + s√ºtunlar vardƒ±r.

- Birden fazla Series yan yana gelince DataFrame olu≈üur.



#### Kƒ±saca √ñzet

- Series = Tek s√ºtun (etiketli NumPy array gibi).

- DataFrame = Birden √ßok s√ºtundan olu≈üan tablo (Excel sayfasƒ± gibi).

In [3]:
import pandas as pd

In [5]:
data = [1,2,3,4,5]
series = pd.Series(data)
print(type(series))
series

<class 'pandas.core.series.Series'>

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [8]:
## Create a Series from dictionary
data = {'a':1,'b':2,'c':3}
series_dict = pd.Series(data)
print(type(series_dict))
print(series_dict)

<class 'pandas.core.series.Series'>
a    1
b    2
c    3
dtype: int64

In [9]:
data =  [10,20,30]
index = ['a','b','c']

pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [14]:
## Dataframe

data = {
    'Name':['Krish','John','Jack'],
    'Age':[25,30,45],
    'City':['Bangalore','New York','Florida']
}

df = pd.DataFrame(data)
print(type(df))
df

<class 'pandas.core.frame.DataFrame'>

    Name  Age       City
0  Krish   25  Bangalore
1   John   30   New York
2   Jack   45    Florida

In [15]:
import numpy as np
np.array(df)

array([['Krish', 25, 'Bangalore'],
       ['John', 30, 'New York'],
       ['Jack', 45, 'Florida']], dtype=object)

In [37]:
## Create a Data frame From a List of Dictionaries

data=[
    {'Name':'Krish','Age':32,'City':'Bangalore'},
    {'Name':'John','Age':34,'City':'Florida'},
    {'Name':'Bappy','Age':32,'City':'New York'},
    {'Name':'Jack','Age':32,'City':'Bangalore'}
    
]
df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age       City
0  Krish   32  Bangalore
1   John   34    Florida
2  Bappy   32   New York
3   Jack   32  Bangalore
<class 'pandas.core.frame.DataFrame'>

In [38]:
df = pd.read_csv('sales_data.csv')
df.head(5) ## excel

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [39]:
df.tail(2)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [40]:
### Accessing Data from Dataframe
df=pd.DataFrame(data)
df

    Name  Age       City
0  Krish   32  Bangalore
1   John   34    Florida
2  Bappy   32   New York
3   Jack   32  Bangalore

In [41]:
print(type(df['Name']))## s√ºtunu aldƒ±ƒüƒ±nda series haline geliyor
df['Name']

<class 'pandas.core.series.Series'>

0    Krish
1     John
2    Bappy
3     Jack
Name: Name, dtype: object

üìå df.loc[]

Label-based indexing (etiket ile eri≈üim) kullanƒ±r.

Yani satƒ±rƒ±n/s√ºtunun isimlerine g√∂re se√ßim yapar.

df.loc[0] ‚Üí index etiketi 0 olan satƒ±rƒ± getirir.

√ñrnek:

import pandas as pd

data = {"Ad": ["Ali", "Ay≈üe", "Mehmet"], "Ya≈ü": [25, 30, 35]}
df = pd.DataFrame(data, index=["a", "b", "c"])

print(df)


üëâ Burada:

df.loc["a"] ‚Üí "Ali" satƒ±rƒ±nƒ± getirir.

df.loc["b"] ‚Üí "Ay≈üe" satƒ±rƒ±nƒ± getirir.

Ama df.loc[0] hata verir ‚ùå √ß√ºnk√º index‚Äôlerde 0 yok.

üìå df.iloc[]

Integer-location based indexing (pozisyon ile eri≈üim) kullanƒ±r.

Yani satƒ±rƒ±n/s√ºtunun konumuna (0,1,2 ‚Ä¶) g√∂re se√ßim yapar.

üëâ Yukarƒ±daki √∂rnekte:

df.iloc[0] ‚Üí ilk satƒ±r ("Ali")

df.iloc[1] ‚Üí ikinci satƒ±r ("Ay≈üe")

Index isimleri ne olursa olsun, iloc sƒ±ra numarasƒ±na bakar.

In [42]:
df.loc[0]

Name        Krish
Age            32
City    Bangalore
Name: 0, dtype: object

In [43]:
df.iloc[0]

Name        Krish
Age            32
City    Bangalore
Name: 0, dtype: object

In [44]:
## Accessing a specified element

df['Name']
df

    Name  Age       City
0  Krish   32  Bangalore
1   John   34    Florida
2  Bappy   32   New York
3   Jack   32  Bangalore

In [45]:
df.at[2,'City']
df.at[1,'Age']

np.int64(34)

In [49]:
df.iat[2,2]

'New York'

In [50]:
## Data Manipulation with Dataframe

## adding a clomn
df['Salary'] = [50000,60000,70000,80000]
df

    Name  Age       City  Salary
0  Krish   32  Bangalore   50000
1   John   34    Florida   60000
2  Bappy   32   New York   70000
3   Jack   32  Bangalore   80000

In [ ]:
## Remove a column
df.drop('Salary',axis=1,inplace=True) 
## axis=1 yapƒ±larak s√ºtundan arama saƒülanƒ±r yoksa default deƒüerle (axis=0) satƒ±rlarƒ± arar.
## inplace = True ile yapƒ±lacak deƒüi≈üikliƒüin kalƒ±cƒ± olmasƒ± saƒülanƒ±r.

In [55]:
df

    Name  Age       City
0  Krish   32  Bangalore
1   John   34    Florida
2  Bappy   32   New York
3   Jack   32  Bangalore

In [57]:
## Add age to the column
df['Age'] = df['Age'] + 2
df

    Name  Age       City
0  Krish   36  Bangalore
1   John   38    Florida
2  Bappy   36   New York
3   Jack   36  Bangalore

In [58]:
df.drop(0) ## 0. indexli satƒ±rƒ± siler inplace=True ile kalƒ±cƒ± hale getirilebilir

    Name  Age       City
1   John   38    Florida
2  Bappy   36   New York
3   Jack   36  Bangalore

In [59]:
df

    Name  Age       City
0  Krish   36  Bangalore
1   John   38    Florida
2  Bappy   36   New York
3   Jack   36  Bangalore

In [60]:
# Display the data types of each column
print("Data types:\n", df.dtypes)

# Describe the DataFrame
print("Statistical summary:\n", df.describe())

Data types:
 Name    object
Age      int64
City    object
dtype: object
Statistical summary:
         Age
count   4.0
mean   36.5
std     1.0
min    36.0
25%    36.0
50%    36.0
75%    36.5
max    38.0

In [66]:
df = pd.DataFrame(data)
df['Salary'] = [50000,70000,100000,900000]
df

    Name  Age       City  Salary
0  Krish   32  Bangalore   50000
1   John   34    Florida   70000
2  Bappy   32   New York  100000
3   Jack   32  Bangalore  900000

In [67]:
df.describe()

        Age         Salary
count   4.0       4.000000
mean   32.5  280000.000000
std     1.0  413843.770844
min    32.0   50000.000000
25%    32.0   65000.000000
50%    32.0   85000.000000
75%    32.5  300000.000000
max    34.0  900000.000000